uploads/run_5102939a/jmeter.log
2025-12-01 21:38:15,880 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-01 21:38:15,963 INFO o.a.j.JMeter: Loading user properties from: C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2025-12-01 21:38:15,995 INFO o.a.j.JMeter: Loading system properties from: C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: Version 5.6.3
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: java.version=17.0.12
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: os.name=Windows 11
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: os.arch=amd64
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: os.version=10.0
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: file.encoding=Cp1252
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-01 21:38:16,031 INFO o.a.j.JMeter: Available Processors =8
2025-12-01 21:38:16,062 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-01 21:38:16,062 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-01 21:38:16,062 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2025-12-01 21:38:16,062 INFO o.a.j.JMeter: user.dir  =C:\Users\MAILS\OneDrive\Desktop\JMeterTestResultsAccelerator_Working19thNov - LIVETEST
2025-12-01 21:38:16,062 INFO o.a.j.JMeter: PWD       =C:\Users\MAILS\OneDrive\Desktop\JMeterTestResultsAccelerator_Working19thNov - LIVETEST
2025-12-01 21:38:16,071 INFO o.a.j.JMeter: IP: 192.168.0.19 Name: SiddharthMathur FullName: SiddharthMathur
2025-12-01 21:38:16,127 INFO o.a.j.s.FileServer: Default base='C:\Users\MAILS\OneDrive\Desktop\JMeterTestResultsAccelerator_Working19thNov - LIVETEST'
2025-12-01 21:38:16,135 INFO o.a.j.s.FileServer: Set new base='C:\Users\MAILS\OneDrive\Desktop\JMeterTestResultsAccelerator_Working19thNov - LIVETEST\uploads\run_5102939a'
2025-12-01 21:38:17,072 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-01 21:38:17,218 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-01 21:38:17,234 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-01 21:38:17,234 INFO o.a.j.s.SaveService: Loading file: uploads\run_5102939a\SimpleScript.jmx
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-01 21:38:17,462 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-01 21:38:17,591 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-01 21:38:17,631 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-01 21:38:17,631 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-01 21:38:17,631 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-01 21:38:17,645 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-01 21:38:17,645 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-01 21:38:17,857 INFO o.a.j.r.ClassFinder: Will scan jar C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-3.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-01 21:38:17,885 INFO o.a.j.r.ClassFinder: Will scan jar C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\validatetg-1.0.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-01 21:38:17,911 INFO o.a.j.r.ClassFinder: Will scan jar C:\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.11.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-01 21:38:18,331 INFO o.a.j.JMeter: Running test (1764625098331)
2025-12-01 21:38:18,371 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Ultimate Thread Group
2025-12-01 21:38:18,377 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group jp@gc - Ultimate Thread Group.
2025-12-01 21:38:18,377 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-01 21:38:18,377 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 10
2025-12-01 21:38:18,388 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2025-12-01 21:38:18,388 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-01 21:38:28,381 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-10
2025-12-01 21:38:28,471 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = SiddharthMathur
2025-12-01 21:38:28,498 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-01 21:38:28,500 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-01 21:38:28,502 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-01 21:38:28,502 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-01 21:38:28,503 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-01 21:38:28,777 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2025-12-01 21:38:28,809 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-12-01 21:38:28,809 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-12-01 21:38:29,295 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2025-12-01 21:38:29,304 INFO o.a.j.u.SSLManager: KeyStore created OK
2025-12-01 21:38:29,304 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2025-12-01 21:38:30,765 INFO o.a.j.r.Summariser: summary +      1 in 00:00:12 =    0.1/s Avg:  2037 Min:  2037 Max:  2037 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2025-12-01 21:38:38,389 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-9
2025-12-01 21:38:48,389 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-8
2025-12-01 21:38:58,378 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-7
2025-12-01 21:39:01,590 INFO o.a.j.r.Summariser: summary +     27 in 00:00:31 =    0.9/s Avg:   567 Min:   523 Max:   667 Err:     0 (0.00%) Active: 4 Started: 4 Finished: 0
2025-12-01 21:39:01,606 INFO o.a.j.r.Summariser: summary =     28 in 00:00:43 =    0.6/s Avg:   619 Min:   523 Max:  2037 Err:     0 (0.00%)
2025-12-01 21:39:08,383 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-6
2025-12-01 21:39:18,389 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-5
2025-12-01 21:39:28,383 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-4
2025-12-01 21:39:30,428 INFO o.a.j.r.Summariser: summary +     59 in 00:00:29 =    2.0/s Avg:   552 Min:   523 Max:   657 Err:     0 (0.00%) Active: 7 Started: 7 Finished: 0
2025-12-01 21:39:30,428 INFO o.a.j.r.Summariser: summary =     87 in 00:01:12 =    1.2/s Avg:   573 Min:   523 Max:  2037 Err:     0 (0.00%)
2025-12-01 21:39:38,391 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-3
2025-12-01 21:39:48,384 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-2